Day-11/results/load-test-after-run1.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Finished 200 requests


Server Software:        Kestrel
Server Hostname:        localhost
Server Port:            5211

Document Path:          /api/day11/authors-with-quotes-slow
Document Length:        84850 bytes

Concurrency Level:      10
Time taken for tests:   1.045 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      16997800 bytes
HTML transferred:       16970000 bytes
Requests per second:    191.42 [#/sec] (mean)
Time per request:       52.240 [ms] (mean)
Time per request:       5.224 [ms] (mean, across all concurrent requests)
Transfer rate:          15887.54 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       3
Processing:    20   45  19.7     41     200
Waiting:       19   40  17.2     37     152
Total:         20   45  19.7     41     200

Percentage of the requests served within a certain time (ms)
  50%     41
  66%     50
  75%     54
  80%     56
  90%     68
  95%     72
  98%    106
  99%    108
 100%    200 (longest request)