Day-11/results/load-test.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Finished 200 requests


Server Software:        Kestrel
Server Hostname:        localhost
Server Port:            5211

Document Path:          /api/day11/authors-with-quotes-slow
Document Length:        84850 bytes

Concurrency Level:      10
Time taken for tests:   4.520 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      16997800 bytes
HTML transferred:       16970000 bytes
Requests per second:    44.25 [#/sec] (mean)
Time per request:       226.003 [ms] (mean)
Time per request:       22.600 [ms] (mean, across all concurrent requests)
Transfer rate:          3672.38 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       3
Processing:    92  219  50.8    217     397
Waiting:       91  212  48.0    206     382
Total:         93  219  50.8    217     397

Percentage of the requests served within a certain time (ms)
  50%    217
  66%    236
  75%    250
  80%    257
  90%    287
  95%    310
  98%    368
  99%    384
 100%    397 (longest request)